Repository: hazzum/Storefront-Frontend
Catalog: src/locale/messages.*.xlf
Languages: ar

source: lrt
ar: rtl

source: storefront-ui
ar: المتجر الإلكتروني الذكي

source: Purchase Details
ar: تفاصيل عملية الشراء

source: Full name
ar: الاسم الكامل

source: Please enter your name
ar: يرجى إدخال اسمك الكامل

source: Name must be at least 3 characters long
ar: لا بد من أن يتكون الاسم من 3 أحرف على الأقل

source: Address
ar: العنوان

source: Please enter your address
ar: يرجى إدخال عنوانك

source: Address must be at least 6 characters long
ar: لا بد من أن يتكون العنوان من 6 رموز على الأقل

source: Credit card number
ar: رقم البطاقة المصرفية

source: Please enter your Credit Card Number
ar: يرجى إدخال رقم البطاقة المصرفية

source: Credit card number must be exactly 16 digits
ar: لا بد أن يكون رقم البطاقة 16 رقمًا بالضبط

source: Invalid credit card number
ar: رقم بطاقة غير صحيح

source: Buy Now!
ar: اشتر الآن!

source: Are you sure you want to proceed with this order?
ar: هل أنت متأكد من إتمام هذا الطلب؟

source: Cart
ar: العربة

source: Item id: {{order.item_id}}
ar: رقم البند التعريفي: {{order.item_id}}

source: Remove
ar: إزالة

source: Order total: {{total | currency}}
ar: إجمالي الطلب: {{total | currency}}

source: Clear cart
ar: إخلاء العربة

source: The Cart is Empty!
ar: العربة فارغة!

source: Are you sure you want to remove all items from the cart?
ar: هل أنت متأكد من إزالة جميع البنود من العربة؟

source: Are you sure you want to remove this item from the cart?
ar: هل أنت متاكد من إزالة هذا البند من العربة؟

source: 🎉🎉 Success! 🎉🎉
ar: 🎉🎉 ألف مبروك! 🎉🎉

source: Thank you,
ar: شكرًا لك يا

source: 🎉🎉 Your order of
ar: 🎉🎉 تم تأكيد طلبك بإجمالي

source: It will be shipped within 1-3 business days
ar: سيصل إليك في خلال 1-3 أيام

source: Order id: {{order.order_id}}
ar: رقم الطلب التعريفي: {{order.order_id}}

source: Quantity:
ar: الكمية:

source: Go back
ar: عد إلى الوراء

source: No past orders were found
ar: لا توجد طلبات سابقة

source: Price:
ar: السعر:

source: Quantity: <select class="select-input" name="my-dropdown" [(ngModel)]="product.quantity"><option *ngFor="let number of numbers" [value]="number" ></option>{CLOSE_TAG_OPTION}</select>
ar: الكمية: <select class="select-input" name="my-dropdown" [(ngModel)]="product.quantity"><option *ngFor="let number of numbers" [value]="number" ></option>{CLOSE_TAG_OPTION}</select>

source: Add to Cart
ar: أضف إلى العربة

source: has been added to the cart!
ar: تمت الإضافة إلى العربة بنجاح!

source: Error:
ar: خطأ:

source: Log in page
ar: صفحة تسجيل الدخول

source: Don't have an account? <a routerLink="/signup">Sign up for an account!</a>
ar: لا تمتلك حسابًا؟<a routerLink="/signup">اضغط هنا لتسجيل حساب جديد!</a>

source: User Name
ar: اسم المستخدم

source: Please enter your user name
ar: يرجى إدخال اسم المستخدم الخاص بك

source: User name must be at least 3 characters long
ar: يجب أن يكون اسم المستخدم مكونًا من ثلاثة أحرف على الأقل

source: Password
ar: كلمة السر

source: Please enter your password
ar: يرجى إدخال كلمة السر

source: Password must be at least 8 characters long
ar: يجب أن تكون كلمة السر مكونة من 8 رموز على الأقل

source: Log in
ar: تسجيل الدخول

source: Sign up page
ar: إنشاء حساب جديد

source: Already a user? <a routerLink="/login">Log in!</a>
ar: لديك حساب بالفعل؟ <a routerLink="/login">اضغط هنا لتسجيل الدخول!</a>

source: First name
ar: الاسم الأول

source: Please enter your first name
ar: يرجى إدخال اسمك الأول

source: First name must be at least 3 characters long
ar: يجب أن يتكون الاسم الأول من ثلاثة حروف على الأقل

source: Last name
ar: الاسم الأخير

source: Please enter your last name
ar: يرجى إدخال اسمك الأخير

source: Last name must be at least 3 characters long
ar: يجب أن يتكون الاسم الأخير من ثلاثة أحرف على الأقل

source: User name
ar: اسم المستخدم

source: Sign up
ar: تسجيل

source: Welcome to My Store{{userName}}!
ar: أهلًا بك في متجري{{userName}}!

source: Product List
ar: قائمة المنتجات

source: Order History
ar: تاريخ الطلبات

source: Sign out
ar: تسجيل الخروج

source: Are you sure you want to sign out
ar: هل أنت متأكد من تسجيل الخروج؟
